In [1]:
#!pip install mysql-connector-python
#!pip install mysql-connector

Requirement already satisfied: mysql-connector-python in /Users/marta/anaconda3/envs/adalabenv/lib/python3.10/site-packages (8.2.0)
Requirement already satisfied: protobuf<=4.21.12,>=4.21.1 in /Users/marta/anaconda3/envs/adalabenv/lib/python3.10/site-packages (from mysql-connector-python) (4.21.12)
Requirement already satisfied: mysql-connector in /Users/marta/anaconda3/envs/adalabenv/lib/python3.10/site-packages (2.2.9)

In [66]:
import pandas as pd

In [67]:
df_premios = pd.read_csv("4.PREMIOS_OSCAR.csv", index_col = 0)
df_premios.head()

,Fecha de la ceremonia,Mejor película,Mejor director,Mejor actor,Mejor actriz
0,1990,Driving Miss Daisy,O. Stone,D. Day-Lewis,J. Tandy
1,1991,Dances with Wolves,K. Costner,J. Irons,K. Bates
2,1992,The Silence of the Lambs,J. Demme,A. Hopkins,J. Foster
3,1993,Unforgiven,C. Eastwood,A. Pacino,E. Thompson
4,1994,Schindler's List,S. Spielberg,T. Hanks,H. Hunter

In [68]:
lista_tuplas_premios = [tuple(x) for x in df_premios.values]
lista_tuplas_premios

[(1990, ' Driving Miss Daisy', ' O. Stone', ' D. Day-Lewis', ' J. Tandy'),
 (1991, ' Dances with Wolves', ' K. Costner', ' J. Irons', ' K. Bates'),
 (1992, ' The Silence of the Lambs', ' J. Demme', ' A. Hopkins', ' J. Foster'),
 (1993, ' Unforgiven', ' C. Eastwood', '  A. Pacino', ' E. Thompson'),
 (1994, " Schindler's List", ' S. Spielberg', ' T. Hanks', ' H. Hunter'),
 (1995, ' Forrest Gump', ' R. Zemeckis', ' T. Hanks', ' J. Lange'),
 (1996, '  Braveheart', ' M. Gibson', ' N. Cage', ' S. Sarandon'),
 (1997, ' The English Patient', ' A. Minghella', ' G. Rush', ' F. McDormand'),
 (1998, 'Titanic', ' J. Cameron', ' J. Nicholson', ' H. Hunt'),
 (1999, ' Shakespeare in Love', ' S. Spielberg', ' R. Benigni', ' G. Paltrow'),
 (2000, ' American Beauty', ' S. Mendes', ' K. Spacey', ' H. Swank'),
 (2001, ' Gladiator', ' S. Soderbergh', ' R. Crowe', ' J. Roberts'),
 (2002, ' A Beautiful Mind', ' R. Howard', ' D. Washington', ' H. Berry'),
 (2003, ' Chicago', ' R. Polanski', ' A. Brody', '  N. Kidman'),
 (2004,
  ' The Lord of the Rings: The Return of the King',
  ' P. Jackson',
  ' S. Penn',
  ' C. Theron'),
 (2005, ' Million Dollar Baby', ' C. Eastwood', ' J. Foxx', ' H. Swank'),
 (2006, ' Crash', ' A. Lee', ' P. S. Hoffman', ' R. Witherspoon'),
 (2007, ' The Departed', ' M. Scorsese', ' F. Whitaker', ' H. Mirren'),
 (2008,
  ' No Country for Old Men',
  ' J. Coen E. Coen',
  ' D. Day-Lewis',
  ' M. Cotillard'),
 (2009, '  Slumdog Millionaire', ' D. Boyle', ' S. Penn', ' K. Winslet'),
 (2010, ' The Hurt Locker', ' K. Bigelow', ' J. Bridges', ' S. Bullock'),
 (2011, " The King's Speech", ' T. Hooper', ' C. Firth', '  N. Portman'),
 (2012, ' The Artist', ' M. Hazanavicius', ' J. Dujardin', ' M. Streep'),
 (2013, ' Argo', ' A. Lee', ' D. Day-Lewis', ' J. Lawrence'),
 (2014,
  '  12 Years a Slave',
  ' A. Cuarón',
  ' M. McConaughey',
  ' C. Blanchett'),
 (2015, ' Birdman or ', ' A. G. Iñárritu', ' E. Redmayne', ' J.Moore'),
 (2016, ' Spotlight', ' A. G. Iñárritu', ' L. DiCaprio', ' B. Larson'),
 (2017, ' Moonlight', '  D. Chazelle', ' C. Affleck', ' E. Stone'),
 (2018, ' The Shape of Water', ' G. del Toro', ' G. Oldman', ' F. McDormand'),
 (2019, ' Green Book', ' A. Cuarón', '  R. Malek', ' O. Colman'),
 (2020, ' Parasite', ' Bong J.', '  J. Phoenix', ' R. Zellweger'),
 (2021, ' Nomadland', ' C. Zhao', ' A. Hopkins', ' F. McDormand'),
 (2022, '  CODA', ' J. Campion', ' W. Smith', ' J. Chastain'),
 (2023,
  ' Everything Everywhere All at Once',
  ' D. Kwan D. Scheinert',
  ' B. Fraser',
  ' M. Yeoh')]

In [ ]:
# nuevo_orden = ["2", "1", "0", "3", "4"]
# df_pelis = df_peli.reindex(columns = nuevo_orden)

# Forma 1 (menos correcta)

In [ ]:
print("INSERT INTO peliculas VALUES")
for peli in lista_tuplas_pelis:
    print(peli, ",")

# Forma 2 (más correcta)

In [69]:
import mysql.connector
from mysql.connector import errorcode

In [70]:
cnx = mysql.connector.connect(user = "root",
                              password = "AlumnaAdalab",
                              host = "127.0.0.1",
                              database = "NETCHILL")#Nuesta base de datos de mysql
#Nos permite enviar informacion atraves de la conexciosm
mycursor = cnx.cursor()


#Escribimos la query aqui
#¡¡¡El ORDEN IMPORTA!!! --> El primer dato debe ser el primer elemento de la lista de tuplas
sql_pelis = "INSERT INTO Premios (fecha_celebracion, mejor_pelicula, mejor_director, mejor_actor, mejor_actriz) VALUES (%s, %s, %s, %s,%s)" 
                        #peliculas el nombre del archivo correspondiente
try:
    mycursor.executemany(sql_pelis, lista_tuplas_premios)
    cnx.commit()
    print(mycursor.rowcount,"registros insertados")
except:
    print("Ha habido un error en la inserción")

34 registros insertados

In [ ]:
#!pip install xlrd

In [ ]:
#!pip install openpyxl

In [71]:
import openpyxl

In [39]:
cnx.close()

In [72]:
df_master = pd.read_excel("0.TODO_GENEROS_PELIS_1990_2023_copy.xlsx")
df_master.head()

,Genero,Tipo,Nombre,Id,Mes,Ano
0,Action,Movie,Spy Story,tt0075259,3.0,1990.0
1,Action,Movie,Comando terrorista,tt0090869,NaN,1990.0
2,Action,Movie,Dragon Hunt,tt0092926,6.0,1990.0
3,Action,Movie,Huang jia shi jie zhi: Zhong jian ren,tt0094376,6.0,1990.0
4,Action,Movie,Soldier of Fortune,tt0094004,4.0,1990.0

In [73]:
df_master.isna().sum()

Genero         0
Tipo           0
Nombre         9
Id             0
Mes       124490
Ano        82714
dtype: int64

In [74]:
df_master.duplicated("Id").sum()

134495

In [75]:
df_master.fillna(0, inplace= True)

In [76]:
df_master.isna().sum()

Genero    0
Tipo      0
Nombre    0
Id        0
Mes       0
Ano       0
dtype: int64

In [77]:
lista_tuplas_master = [tuple(x) for x in df_master.values]

In [78]:
#Primero eliminamos duplicados convirtiendolo en set que quita los repetidos
set(lista_tuplas_master)
print(len(lista_tuplas_master), len(set(lista_tuplas_master)))

547650 546311

In [79]:
lista_tuplas_master = list(set(lista_tuplas_master))
#Limpiamos corchetes y comillas antes de meter en mysql

In [80]:
cnx = mysql.connector.connect(user = "root",
                              password = "AlumnaAdalab",
                              host = "127.0.0.1",
                              database = "NETCHILL")#Nuesta base de datos de mysql
#Nos permite enviar informacion atraves de la conexciosm
mycursor = cnx.cursor()

#¡¡¡El ORDEN IMPORTA!!! --> El primer dato debe ser el primer elemento de la lista de tuplas
sql_pelis = "INSERT INTO MASTER (genero, tipo, titulo, id_pelicula, mes, anio) VALUES (%s, %s, %s, %s,%s, %s)" 
                        #peliculas el nombre del archivo correspondiente
try:
    mycursor.executemany(sql_pelis, lista_tuplas_master)
    cnx.commit()
    print(mycursor.rowcount,"registros insertados")
except mysql.connector.Error as err:

  # si es un error con la contraseña devuelveme un mensaje de acceso denegado ya que tenemos problemas con la contraseña
  if err.errno == errorcode.ER_ACCESS_DENIED_ERROR:
    print("Something is wrong with your user name or password")
  
  # si el error no tiene que ver con la contraseña, puede ser porque la base de datos no exista, devuelveme un mensaje de que la base de datos no existe
  elif err.errno == errorcode.ER_BAD_DB_ERROR:
    print("Database does not exist")
  
  # si no es por ninguno de los errores anteriores, printeame cual es el error que estoy teniendo en mi conexión
  else:
    print(err)

546311 registros insertados

In [82]:
cnx.close()

In [83]:
lista_tuplas_master[1053]

('Comedy', 'Short', 'Planned Obsolescence', 'tt27780897', 5.0, 2023.0)

In [190]:
df_detalles = pd.read_csv("1.detalles_shorts_drama.csv")
df_detalles.drop(columns=["Unnamed: 0"], inplace=True)
df_detalles.head()

,IMDB,RT,Direccion,Guión,Argumento,Duración,Título
0,7.9,--,Kari Paljakka,Kari Paljakka,NaN,20m,Nonstop
1,6.8,--,Krzysztof Kieslowski,Krzysztof Kieslowski,Seven Days a Week is truly the last documentar...,18m,Seven Days a Week - CITY LIFE - Warsaw
2,6.1,--,Tracey Moffatt,Tracey Moffatt,A middle aged Aboriginal woman nurses her dyin...,19m,Night Cries: A Rural Tragedy
3,5.6,--,Danièle HuilletJean-Marie Straub,Friedrich HölderlinDanièle HuilletJean-Marie S...,A short story based on the work of Friedrich H...,42m,Schwarze Sünde
4,7.1,67%,George Scribner,Gerrit GrahamSam GrahamChris Hubbell,A poor boy and a prince exchange identities an...,25m,The Prince and the Pauper

In [191]:
df_detalles.duplicated().sum()

2

In [192]:
df_detalles.fillna(0, inplace= True)

In [193]:
lista_tuplas_detalles = [tuple(x) for x in df_detalles.values]
#Primero eliminamos duplicados convirtiendolo en set que quita los repetidos
set(lista_tuplas_detalles)
print(len(lista_tuplas_detalles), len(set(lista_tuplas_detalles)))

680 678

In [194]:
lista_tuplas_detalles = list(set(lista_tuplas_detalles))

In [195]:
#PARA QUE NO SE EJECUTE cnx = mysql.connector.connect(user = "root",
                              password = "AlumnaAdalab",
                              host = "127.0.0.1",
                              database = "NETCHILL")#Nuesta base de datos de mysql
#Nos permite enviar informacion atraves de la conexciosm
mycursor = cnx.cursor()

#¡¡¡El ORDEN IMPORTA!!! --> El primer dato debe ser el primer elemento de la lista de tuplas
sql_pelis = "INSERT INTO Detalles_Peliculas (IMDB, RT, direccion, guion, argumento, duracion, titulo) VALUES (%s, %s, %s, %s,%s, %s, %s)" 
                        #peliculas el nombre del archivo correspondiente
try:
    mycursor.executemany(sql_pelis, lista_tuplas_detalles)
    cnx.commit()
    print(mycursor.rowcount,"registros insertados")
except mysql.connector.Error as err:

  # si es un error con la contraseña devuelveme un mensaje de acceso denegado ya que tenemos problemas con la contraseña
  if err.errno == errorcode.ER_ACCESS_DENIED_ERROR:
    print("Something is wrong with your user name or password")
  
  # si el error no tiene que ver con la contraseña, puede ser porque la base de datos no exista, devuelveme un mensaje de que la base de datos no existe
  elif err.errno == errorcode.ER_BAD_DB_ERROR:
    print("Database does not exist")
  
  # si no es por ninguno de los errores anteriores, printeame cual es el error que estoy teniendo en mi conexión
  else:
    print(err)

678 registros insertados

In [197]:
df_actores = pd.read_excel("detalles_actores.xlsx")
df_actores.head()

,nombre,nacimiento,conocido,ocupacion,premios
0,Michael Petrovitch,1945,"La banda del zoológico\n7,5\nSerie de TV\nLt. ...",Reparto,no tiene Óscar
1,Philip Latham,1929,"Drácula, príncipe de las tinieblas\n6,6\nKlove...",Reparto,no tiene Óscar
2,Don Fellows,1922,"En busca del arca perdida\n8,4\nCol. Musgrove\...",Reparto,no tiene Óscar
3,Michael Gwynn,1916,"Jasón y los argonautas\n7,3\nHermesPriest\n1963",Reparto,no tiene Óscar
4,Nicholas Parsons,1923,"Happy Is the Bride\n6,9\nJohn Royd\n1958",Reparto\nDirección\nGuion,no tiene Óscar

In [198]:
df_actores.duplicated().sum()

203

In [200]:
lista_tuplas_detalles = [tuple(x) for x in df_actores.values]
#Primero eliminamos duplicados convirtiendolo en set que quita los repetidos
set(lista_tuplas_detalles)
print(len(lista_tuplas_detalles), len(set(lista_tuplas_detalles)))

1181 978

In [201]:
lista_tuplas_detalles = list(set(lista_tuplas_detalles))

In [204]:
cnx = mysql.connector.connect(user = "root",
                              password = "AlumnaAdalab",
                              host = "127.0.0.1",
                              database = "NETCHILL")#Nuesta base de datos de mysql
#Nos permite enviar informacion atraves de la conexciosm
mycursor = cnx.cursor()

#¡¡¡El ORDEN IMPORTA!!! --> El primer dato debe ser el primer elemento de la lista de tuplas
sql_pelis = "INSERT INTO Detalles_Actores (nombre, nacimiento, conocido, ocupacion, premios) VALUES (%s, %s, %s, %s, %s)" 
                        #peliculas el nombre del archivo correspondiente
try:
    mycursor.executemany(sql_pelis, lista_tuplas_detalles)
    cnx.commit()
    print(mycursor.rowcount,"registros insertados")
except mysql.connector.Error as err:

  # si es un error con la contraseña devuelveme un mensaje de acceso denegado ya que tenemos problemas con la contraseña
  if err.errno == errorcode.ER_ACCESS_DENIED_ERROR:
    print("Something is wrong with your user name or password")
  
  # si el error no tiene que ver con la contraseña, puede ser porque la base de datos no exista, devuelveme un mensaje de que la base de datos no existe
  elif err.errno == errorcode.ER_BAD_DB_ERROR:
    print("Database does not exist")
  
  # si no es por ninguno de los errores anteriores, printeame cual es el error que estoy teniendo en mi conexión
  else:
    print(err)

978 registros insertados

In [205]:
cnx.close()